Table of Contents
 Struct StrainImpulse
Namespace
IdeaRS.OpenModel.Loading
Assembly
IdeaRS.OpenModel.dll
Generalized strain load impulse.
public struct StrainImpulse
Inherited Members
 ValueType.Equals(object)
 ValueType.GetHashCode()
 ValueType.ToString()
 object.Equals(object, object)
 object.GetType()
 object.ReferenceEquals(object, object)
Properties
 EpsX
The normal strain.
public double EpsX { get; set; }
Property Value
double
 GammaXY
The shear strain.
public double GammaXY { get; set; }
Property Value
double
 GammaXZ
The shear strain.
public double GammaXZ { get; set; }
Property Value
double
 PhiX
The torsion slope around x axis.
public double PhiX { get; set; }
Property Value
double
 PhiY
The curvature around z axis.
public double PhiY { get; set; }
Property Value
double
 PhiZ
The curvature around y axis.
public double PhiZ { get; set; }
Property Value
double
 Edit this page